{
    "Title": "Housing and accommodations in Canada",
    "Source(link)": "https://www.educanada.ca/study-plan-etudes/before-avant/housing-logement.aspx?lang=eng",
    "Date": "2023-08-21 19:18:38",
    "subheadings": [
        {
            "subheading": "Housing and accommodations in Canada",
            "content": "Canadian students often choose to live on campus during their 1st year of post-secondary education. As an international student, this option may appeal to you, too. It’s a great way to meet friends and connect with other students.If you’re sending your child to Canada for high school or an exchange program, they’ll likely stay with a Canadian family as part of a homestay program. Some private high schools in Canada offer dormitory housing to allow students to live, eat and sleep at the school.This section answers important questions about college and university housing, including:Living on campusLiving off campus in private housingTo find out more about planning for the costs of housing in Canada, visit our Prepare your budget page."
        },
        {
            "subheading": "Living on campus at college or university",
            "content": "If you live in college or university housing on or near your campus, this is called “living in residence.” If you come to Canada for 1 or 2 semesters only, living in residence can be easier than finding your own housing off campus. A room in residence will be furnished with a bed, shelves and a desk. The cost of living in residence often includes the option of adding a meal plan, so you can eat breakfast, lunch and dinner on campus."
        },
        {
            "subheading": "Living off campus in private housing",
            "content": "If you choose to live off campus, the rental price may be lower than living in residence. Keep in mind, however, that you’ll need to pay for additional items, including:  Furniture (unless the apartment is furnished)Bedding and towelsCooking utensils for the kitchenFood and cleaning suppliesElectricityHeatingInternet connectionCable television or streaming serviceLaundry machines may be available onsite. If not, you can take your clothing to a laundromat and pay to wash and dry your clothes.The benefits of living in private housing can include feeling that you:Have more freedomHave more privacyAre integrating into Canadian societyYou may also find that shared housing options will save you money."
        },
        {
            "subheading": "Residence room options",
            "content": "Your room in residence may be single or shared. A shared room costs less than a single room. Some universities offer only shared rooms for 1st year students. When you live in residence, you have access to:Your private roomA shared bathroom (toilet, sink, bathtub or shower)A kitchenLaundry facilitiesFree wifi (in most cases)Some universities also offer apartment-style residence buildings where you can live with other students in an apartment. An apartment includes its own kitchen and bathroom."
        },
        {
            "subheading": "Benefits of residence",
            "content": "The benefits of living in residence include:Easy access to the campus and libraryLess need for transportationChance to make friendsA smoother transition to living as a student in your new countryWhen you register at your college or university, you can determine the cost of living in residence and decide if this option works for you."
        },
        {
            "subheading": "Housing terms in Canada",
            "content": "When you choose private housing, you’ll need to know the definitions of housing terms that are common and unique to Canada.Bachelor apartment: An apartment comprised of 1 large room that acts as your bedroom and living room. It includes a kitchen area and bathroom.Duplex: A building that contains 2 living spaces or apartments.Single-detached: A building that contains only 1 living space, perhaps on 2 or 3 storeys. If the building is only 1 storey, it’s called a bungalow.Private room: A room in a person’s home. When you rent a private room, you get access to a shared kitchen, bathroom and sometimes other parts of the home, such as the living room. This can be an affordable way to rent. Some homeowners may also include “board” with your private room. This means they will provide you with 1 or more meals per day.Den: A small room, with or without a door. Many apartments consist of 1 bedroom, plus den. You could use a den as a living room, office or for storage.Ensuite (bathroom): A bathroom that you can directly access from the bedroom. Some apartments have an ensuite bathroom and a 2nd bathroom for guests.Powder room: A small bathroom with only a toilet and sink (no shower or bathtub). A full bathroom always includes a shower or bathtub.AC: Air-conditioner. Many parts of Canada are hot in the summer, but not all apartments or homes have AC.Furnished: Rent for the apartment or house will include basic furniture like a couch, table and bed. A stove and refrigerator will also be supplied, and perhaps a dishwasher, clothes dryer and washer.Unfurnished: Rent for the apartment or home may include a stove, fridge, dishwasher and other appliances. Be sure to ask what your rent includes. An unfurnished rental means the rooms will be empty when you move in, so you need to supply your own furniture. Utilities: Utilities refer to electricity (often called hydro in Canada), water, heat and AC. It’s important to know whether you or the landlord pays for utilities. Sometimes, rent includes utilities (the landlord pays). Sometimes, the tenant pays for them based on the amount of electricity, heat or water they use each month.Lease: A contract between you and your landlord that sets out the rent and how long you will live in the apartment or house.Sublet: If your lease has not expired and you want to leave the apartment or house, you can reach a new agreement with someone to assume the lease until it expires. They’ll be subletting the apartment from you. Be sure to ask your landlord for permission to sublet your apartment."
        },
        {
            "subheading": "Signing a lease and paying a damage deposit",
            "content": "When you rent an apartment or house off campus, you should expect to:Sign a lease (9 or 10-month leases are common in some university and college towns).Pay the first month’s rent immediately.Pay the last month’s rent immediately (this is legal; it protects the landlord in case you decide to leave suddenly).Pay a damage deposit to the landlord.A damage deposit is money you pay the landlord before you move into the housing unit. It may be as much as one month’s rent. In fact, it can be any amount your landlord decides to charge:If you damage the housing during your lease, the landlord keeps the amount of the damage deposit to pay for repairs to the unit (if the damage costs more than your deposit amount, you will be responsible for paying for it).If you do not damage the housing, the landlord returns the amount of the damage deposit to you at the end of your lease."
        },
        {
            "subheading": "How to find private housing",
            "content": "Your university or college may have a housing office that helps students find housing. The student union or student association on campus is another good source of information. They may offer an online list of private housing near the campus.You can also check local newspapers, Kijiji or Craig’s List to find accommodation. Note that:Canadians who own properties near large university campuses may rent rooms or apartments in their home to students.Apartment buildings that specialize in renting to students often exist near university and college campuses."
        },
        {
            "subheading": "Costs for private housing",
            "content": "Private housing is not controlled or inspected in any way by your university or college.Price and quality can vary, so be sure to schedule an appointment to view the housing before you sign a lease. Here are some tips to help you plan for the cost of housing:Expect to pay from CAD 400 to CAD 800 to rent a room in a house. The cost may be slightly higher and include food if the homeowner says they offer “board” with the room. If you rent a room in house shared by students, you’ll need to pay for your room and buy your own food.An apartment in a high-rise building may cost CAD 900 to CAD 2,000 per month, depending on the city or town where you live and the number of rooms in it. Keep in mind that you can reduce your costs by sharing an apartment with other students.In large cities like Toronto and Vancouver, apartment rentals are popular. An apartment rental can cost CAD 900 to CAD 3,000 per month depending on how many bedrooms it has, the neighbourhood and age of the building.Our Search colleges and universities tool can help you estimate the cost of living based on the school you plan to attend. Why not give it a try?"
        },
        {
            "subheading": "Dealing with your landlord",
            "content": "When you sign a lease to rent a room, apartment or other type of housing, you are entering into a legal agreement with a landlord. Each of you will have certain obligations.Your landlord is required to:Maintain your home in a good state of repairProvide the utility services (heat, electricity, other) agreed to in the leaseNot seize your property without following a proper legal processAs the tenant, you are expected to:Pay your rent on timeKeep your rental unit cleanAvoid causing any damage and pay for the repairs of any damage you causeContact your landlord as soon as you can when there is a serious problem needing repair or serviceAllow your landlord entry to your space for repairs (with notice)Most landlords expect you to pay rent by cheque and may ask you to provide 10 or 12 cheques to cover the full period of your lease. These are called post-dated cheques. Landlords do not accept credit card payments.Landlords may add various rules and conditions to the lease. For example, the lease may say you cannot smoke in your apartment or on the balcony. Some buildings allow pets such as dogs or cats, while others don’t allow any pets. Read the lease carefully before you sign it. Ask for a copy.The landlord also has responsibilities, such as keeping the housing in good repair:In an emergency, the landlord may enter your dwelling without asking your permission. Otherwise, the landlord cannot enter without giving you a reason and advance notice.If the landlord needs you to vacate the premises, 60 days’ notice is required.If you have trouble with your landlord, the housing office at your college or university may offer free or low-cost legal advice. They can certainly give you advice about where to get legal help.Each province and territory has laws that govern landlord-tenant relations. As an international student, you’re protected by those laws.Search colleges & universitiesStudy costsPrepare your budgetStories of international students in CanadaStudying in Canada: Pre-departure guideStudy in Canada NewsRelatedCanada Homestay NetworkStudent housing in Canada"
        }
    ]
}